fornellas/sketchbook/hardware/custom/boards.txt
atmega328ppu8rc.name=ATmega328P-PU (8MHz Internal RC Oscilator)
atmega328ppu8rc.upload.maximum_size=30720
atmega328ppu8rc.upload.protocol=arduino
atmega328ppu8rc.upload.speed=57600
atmega328ppu8rc.bootloader.low_fuses=0xE2
atmega328ppu8rc.bootloader.high_fuses=0xDA
atmega328ppu8rc.bootloader.extended_fuses=0x05
atmega328ppu8rc.bootloader.path=arduino:atmega
atmega328ppu8rc.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex
atmega328ppu8rc.bootloader.unlock_bits=0x3F
atmega328ppu8rc.bootloader.lock_bits=0x0F
atmega328ppu8rc.build.mcu=atmega328p
atmega328ppu8rc.build.f_cpu=8000000L
atmega328ppu8rc.build.core=arduino:arduino
atmega328ppu8rc.build.variant=arduino:standard

atmega328ppu8c.name=ATmega328P-PU (8MHz Crystal)
atmega328ppu8c.upload.maximum_size=30720
atmega328ppu8c.upload.protocol=arduino
atmega328ppu8c.upload.speed=57600
atmega328ppu8c.bootloader.low_fuses=0xFF
atmega328ppu8c.bootloader.high_fuses=0xDA
atmega328ppu8c.bootloader.extended_fuses=0x05
atmega328ppu8c.bootloader.path=arduino:atmega
atmega328ppu8c.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex
atmega328ppu8c.bootloader.unlock_bits=0x3F
atmega328ppu8c.bootloader.lock_bits=0x0F
atmega328ppu8c.build.mcu=atmega328p
atmega328ppu8c.build.f_cpu=8000000L
atmega328ppu8c.build.core=arduino:arduino
atmega328ppu8c.build.variant=arduino:standard

atmega328ppu12c.name=ATmega328P-PU (12MHz Crystal)
atmega328ppu12c.upload.maximum_size=30720
atmega328ppu12c.upload.speed=57600
atmega328ppu12c.bootloader.low_fuses=0xFF
atmega328ppu12c.bootloader.high_fuses=0xDA
atmega328ppu12c.bootloader.extended_fuses=0x05
atmega328ppu12c.bootloader.path=arduino:atmega
atmega328ppu12c.bootloader.unlock_bits=0x3F
atmega328ppu12c.bootloader.lock_bits=0x0F
atmega328ppu12c.build.mcu=atmega328p
atmega328ppu12c.build.f_cpu=12000000L
atmega328ppu12c.build.core=arduino:arduino
atmega328ppu12c.build.variant=arduino:standard

atmega328ppu16c.name=ATmega328P-PU (16MHz Crystal)
atmega328ppu16c.upload.maximum_size=30720
atmega328ppu16c.upload.protocol=arduino
atmega328ppu16c.upload.speed=57600
atmega328ppu16c.bootloader.low_fuses=0xFF
atmega328ppu16c.bootloader.high_fuses=0xDA
atmega328ppu16c.bootloader.extended_fuses=0x05
atmega328ppu16c.bootloader.path=arduino:atmega
atmega328ppu16c.bootloader.file=ATmegaBOOT_168_atmega328.hex
atmega328ppu16c.bootloader.unlock_bits=0x3F
atmega328ppu16c.bootloader.lock_bits=0x0F
atmega328ppu16c.build.mcu=atmega328p
atmega328ppu16c.build.f_cpu=16000000L
atmega328ppu16c.build.core=arduino:arduino
atmega328ppu16c.build.variant=arduino:standard

atmega328ppu20c.name=ATmega328P-PU (20MHz Crystal)
atmega328ppu20c.upload.maximum_size=30720
atmega328ppu20c.upload.protocol=arduino
atmega328ppu20c.upload.speed=57600
atmega328ppu20c.bootloader.low_fuses=0xF7
atmega328ppu20c.bootloader.high_fuses=0xDA
atmega328ppu20c.bootloader.extended_fuses=0x05
atmega328ppu20c.bootloader.path=arduino:atmega
atmega328ppu20c.bootloader.unlock_bits=0x3F
atmega328ppu20c.bootloader.lock_bits=0x0F
atmega328ppu20c.build.mcu=atmega328p
atmega328ppu20c.build.f_cpu=20000000L
atmega328ppu20c.build.core=arduino:arduino
atmega328ppu20c.build.variant=arduino:standard

attiny8420pu1rc.name=ATtiny84-20PU (1MHz Internal RC Oscilator)
attiny8420pu1rc.bootloader.low_fuses=0x62
attiny8420pu1rc.bootloader.high_fuses=0xdf
attiny8420pu1rc.bootloader.extended_fuses=0xff
attiny8420pu1rc.upload.maximum_size=8192
attiny8420pu1rc.build.mcu=attiny84
attiny8420pu1rc.build.f_cpu=1000000L
attiny8420pu1rc.build.core=arduino:arduino
attiny8420pu1rc.build.variant=tiny14

attiny8420pu8rc-8.name=ATtiny84-20PU (8MHz Internal RC Oscilator)
attiny8420pu8rc-8.bootloader.low_fuses=0xe2
attiny8420pu8rc-8.bootloader.high_fuses=0xdf
attiny8420pu8rc-8.bootloader.extended_fuses=0xff
attiny8420pu8rc-8.upload.maximum_size=8192
attiny8420pu8rc-8.build.mcu=attiny84
attiny8420pu8rc-8.build.f_cpu=8000000L
attiny8420pu8rc-8.build.core=arduino:arduino
attiny8420pu8rc-8.build.variant=tiny14

attiny8420pu20c.name=ATtiny84-20PU (20MHz Crystal)
attiny8420pu20c.bootloader.low_fuses=0xfe
attiny8420pu20c.bootloader.high_fuses=0xdf
attiny8420pu20c.bootloader.extended_fuses=0xff
attiny8420pu20c.upload.maximum_size=8192
attiny8420pu20c.build.mcu=attiny84
attiny8420pu20c.build.f_cpu=20000000L
attiny8420pu20c.build.core=arduino:arduino
attiny8420pu20c.build.variant=tiny14

attiny8520pu1rc.name=ATtiny85-20PU (1MHz Internal RC Oscilator)
attiny8520pu1rc.bootloader.low_fuses=0x62
attiny8520pu1rc.bootloader.high_fuses=0xdf
attiny8520pu1rc.bootloader.extended_fuses=0xff
attiny8520pu1rc.upload.maximum_size=8192
attiny8520pu1rc.build.mcu=attiny85
attiny8520pu1rc.build.f_cpu=1000000L
attiny8520pu1rc.build.core=arduino:arduino
attiny8520pu1rc.build.variant=tiny8

attiny8520pu8rc.name=ATtiny85-20PU (8MHz Internal RC Oscilator)
attiny8520pu8rc.bootloader.low_fuses=0xe2
attiny8520pu8rc.bootloader.high_fuses=0xdf
attiny8520pu8rc.bootloader.extended_fuses=0xff
attiny8520pu8rc.upload.maximum_size=8192
attiny8520pu8rc.build.mcu=attiny85
attiny8520pu8rc.build.f_cpu=8000000L
attiny8520pu8rc.build.core=arduino:arduino
attiny8520pu8rc.build.variant=tiny8

attiny8520pu20c.name=ATtiny85-20PU (20MHz Crystal)
attiny8520pu20c.bootloader.low_fuses=0xfe
attiny8520pu20c.bootloader.high_fuses=0xdf
attiny8520pu20c.bootloader.extended_fuses=0xff
attiny8520pu20c.upload.maximum_size=8192
attiny8520pu20c.build.mcu=attiny85
attiny8520pu20c.build.f_cpu=20000000L
attiny8520pu20c.build.core=arduino:arduino
attiny8520pu20c.build.variant=tiny8
